import { BiMessageRoundedAdd, BiUser } from 'react-icons/bi';
import { BsSuitcase } from 'react-icons/bs';
import { GoBell, GoHome } from 'react-icons/go';
import { HiOutlineUserGroup } from 'react-icons/hi';
import { IoEyeOutline } from 'react-icons/io5';
import { MdOutlineRoomService } from 'react-icons/md';
import { RiCustomerService2Line } from 'react-icons/ri';

export const navMenuLinks = [
  {
    id: 1,
    title: 'صفحه اصلی',
    icon: (
      <svg
        xmlns="http://www.w3.org/2000/svg"
        fill="none"
        viewBox="0 0 24 24"
        strokeWidth="1.5"
        stroke="#777"
        className="h-5 w-5"
      >
        <path
          strokeLinecap="round"
          strokeLinejoin="round"
          d="m2.25 12 8.954-8.955c.44-.439 1.152-.439 1.591 0L21.75 12M4.5 9.75v10.125c0 .621.504 1.125 1.125 1.125H9.75v-4.875c0-.621.504-1.125 1.125-1.125h2.25c.621 0 1.125.504 1.125 1.125V21h4.125c.621 0 1.125-.504 1.125-1.125V9.75M8.25 21h8.25"
        />
      </svg>
    ),
  },
  {
    id: 2,
    title: 'علاقه مندی ها',
    icon: (
      <svg
        xmlns="http://www.w3.org/2000/svg"
        fill="none"
        viewBox="0 0 24 24"
        strokeWidth="1.5"
        stroke="currentColor"
        className="h-5 w-5"
      >
        <path
          strokeLinecap="round"
          strokeLinejoin="round"
          d="M21 8.25c0-2.485-2.099-4.5-4.688-4.5-1.935 0-3.597 1.126-4.312 2.733-.715-1.607-2.377-2.733-4.313-2.733C5.1 3.75 3 5.765 3 8.25c0 7.22 9 12 9 12s9-4.78 9-12Z"
        />
      </svg>
    ),
  },
];

export const hostData = [
  {
    id: 1,
    heading: 'ابتدا ثبت نام کنید',
    text: 'ابتدا ثبت‌نام کنید تا برای جاجیگا قابل شناسایی شوید و بتوانید تنظیمات شخصی خودتان را اعمال کنید.',
    infos: [
      {
        icon: <BiUser size={40} className="text-gray-800 dark:text-gray-200" />,
        title: 'حساب کاربری حاوی چه مطالبی ست؟',
        subtitle:
          'برای ثبت‌نام کافیست نام، نام خانوادگی و شماره موبایل خود را وارد کنید. پس از ثبت‌نام می توانید اقامتگاه خود را به رایگان در سایت ثبت کنید. البته برای انتشار اقامتگاه و شروع میزبانی در سایت می باید با تکمیل حساب کاربری، آن را به تایید برسانید و به سطح "تایید شده" ارتقا دهید. حتما تصویر با کیفیت و شادی از خود را در پروفایل حساب کاربری اضافه کنید تا تاثیر خوشایندی بر مهمانان بگذارید.',
      },
      {
        icon: (
          <IoEyeOutline
            size={40}
            className="text-gray-800 dark:text-gray-200"
          />
        ),
        title: 'چه اطلاعاتی از من قابل مشاهده است؟',
        subtitle:
          'درشرایط معمول تنها اسم کوچک, تصویر کاربری و شرحی که درباره خود می نویسید برای سایرین قابل مشاهده خواهد بود. هنگامی که اقامتگاه شما توسط یک میهمان رزرو شود, نام، نام خانوادگی, شماره تماس و آدرس دقیق اقامتگاه شما در سند رزرو ثبت می شود و برای میهمان قابل مشاهده خواهد بود. سایر اطلاعات ثبت شده, بطور کاملا محرمانه ذخیره شده و قابل دسترسی نمی‌باشد.',
      },
      {
        icon: (
          <BsSuitcase size={40} className="text-gray-800 dark:text-gray-200" />
        ),
        title: 'چرا باید حساب کاربری خود را تکمیل کنم ؟',
        subtitle:
          'تکمیل اطلاعات هویتی همچون کد ملی و آپلود کارت ملی موجب افزایش ایمنی کاربران جاجیگا بوده و زمینه ساز تعامل ایمن و توام با آسودگی کاربران با یکدیگر می‌باشد. تکمیل اطلاعات ارتباطی همچون ایمیل نیز باعث سهولت بیشتر در عملکرد سامانه و تسهیل در ارسال به موقع اعلان های فصلی و نکات و آموزش های دوره ای برای میزبان ها می شود.',
      },
    ],
  },
  {
    id: 2,
    heading: 'اقامتگاه خود را ثبت کنید',
    text: 'حال می بایست برای معرفی اقامتگاه خود به گردشگران, یک نمایه (پروفایل) برای اقامتگاه خود ایجاد کنید.',
    infos: [
      {
        icon: <GoHome size={40} className="text-gray-800 dark:text-gray-200" />,
        title: 'نمایه اقامتگاه من حاوی چه مطالبی ست؟',
        subtitle:
          'در نمایه اقامتگاه, شما می بایست مشخصات دقیق منزل و امکانات قابل استفاده توسط میهمانان را مشخص کنید. عکسهایی واضح و جدید از اقامتگاه خود فراهم نموده و Upload کنید, همچنین نرخ اجاره بها و تقویم اجاره منزل خود در روزهای مختلف هفته و فصول مختلف سال را نیز تنظیم کنید. در آخر مقرراتی که می باید توسط میهمانان رعایت شود را نیز مشخص کنید. نمایه اقامتگاه شما درواقع بیانگر مشخصات و ویژگیهای واقعی منزل شما برای گردشگران علاقه مند خواهد بود.',
      },
      {
        icon: (
          <MdOutlineRoomService
            size={40}
            className="text-gray-800 dark:text-gray-200"
          />
        ),
        title: 'چه کسانی می‌توانند اقامتگاهم را اجاره کنند؟',
        subtitle:
          'شما در کنار ثبت مشخصات و امکانات اقامتگاه خود, مواردی همچون تقویم کاری اقامتگاه, اجاره بها و مقررات منزل را نیز تعیین می کنید. سپس نمایه اقامتگاه شما در وبسایت منتشر می شود و برای مسافرین و گردشگران به نمایش درمی آید. گردشگرانی که دارای حساب کاربری در جاجیگا باشند, با جستجو در وبسایت, در صورتی که مشخصات اقامتگاه شما را مناسب نیاز خود بیابند درصورت قبول مقررات منزل, برای اجاره اقامتگاه در بازه زمانی مد نظر "درخواست رزرو" ارسال می کنند. درصورت تایید شما و پرداخت صورتحساب توسط مهمان، رزرو قطعی می شود و سند رزرو صادر می گردد.',
      },
      {
        icon: (
          <RiCustomerService2Line
            size={40}
            className="text-gray-800 dark:text-gray-200"
          />
        ),
        title: 'آیا میزبانی و رزرو اینترنتی سخت است؟',
        subtitle:
          'امکانات تعبیه شده در سایت بگونه ای ست تا پس از صرف وقت کافی برای ثبت و انتشار اقامتگاه خود, بتوانید تمام مراحل میزبانی شامل معرفی اقامتگاه, بازاریابی, ارتباطات, رزرواسیون, دریافت وجوه و پشتیبانی, را طی فرایندی ساده و کاربردی و با صرف زمانی اندک, برای شما امکانپذیر نماید. با این وجود, ما از لحظه ثبت‌نام، ثبت اقامتگاه و آغاز میزبانی, در کنارتان هستیم و شما را در این مسیر هیجان انگیز همراهی میکنیم.',
      },
    ],
  },
  {
    id: 3,
    heading: 'برای ورود مهمانان آماده شوید!',
    text: 'هنگامی که یک مهمان اقامتگاه شما را انتخاب نماید, درخواست رزرو خود را ثبت کرده و ارسال می‌کند.',
    infos: [
      {
        icon: <GoBell size={40} className="text-gray-800 dark:text-gray-200" />,
        title: 'چگونه از دریافت درخواست رزرو مطلع شوم؟',
        subtitle:
          'برای سرعت بخشیدن به فرایند رزرو, ثبت درخواست رزرو توسط میهمان یا قطعی شدن رزرو با بهره گیری از سامانه اس ام اس متنی و تماس های خودکار صوتی و همچنین سرویس ایمیل به اطلاع میزبان می‌رسد تا در اسرع وقت از وضعیت رزرو آگاهی یافته و اقدامات لازم را به انجام برساند. در مواقع ضروری تیم پشتیبانی جاجیگا نیز با دو طرف رزرو تماس خواهند گرفت. هرگونه تغییری در وضعیت رزرو, به همین روشها به اطلاع دو طرف خواهد رسید.',
      },
      {
        icon: (
          <HiOutlineUserGroup
            size={40}
            className="text-gray-800 dark:text-gray-200"
          />
        ),
        title: 'فرایند تحویل اقامتگاه چگونه است؟',
        subtitle:
          'پس از قطعی شدن رزرو اقامتگاه, سند رزرو قطعی حاوی اطلاعات کامل رزرو , نام و نام خانوادگی, تعداد نفرات, تاریخ و ساعت ورود و خروج, جزییات صورتحساب پرداخت شده, آدرس دقیق اقامتگاه و شماره تماس میهمان و میزبان برای هر دو طرف ارسال می گردد. توصیه می شود میزبان پیش از شروع سفر با میهمان تماس گرفته و هماهنگی های لازم برای نحوه و زمان تحویل اقامتگاه به ایشان را به انجام برساند تا میهمان با خیالی آسوده سفر خود را آغاز نماید.',
      },
      {
        icon: (
          <BiMessageRoundedAdd
            size={40}
            className="text-gray-800 dark:text-gray-200"
          />
        ),
        title: 'آیا راهی برای ارتباط با میهمانان وجود دارد؟',
        subtitle:
          'ممکن است میهمان پیش از رزرو اقامتگاه, سوالاتی در مورد شرایط منزل و یا شرایط عمومی منطقه داشته باشد, یا ممکن است میزبان, پیش از قبول درخواست رزرو بخواهد سوالاتی از میهمان بپرسد. در این مواقع دو طرف رزرو می توانند با ارسال "پیام " در کادر مخصوص تعبیه شده در صفحه رزرو اقامتگاه، سوال و یا جواب خود را در مراحل مختلف رزرو برای طرف مقابل ارسال نمایند و سپس در صورت رفع ابهام رزرو را تایید یا قطعی نمایند.',
      },
    ],
  },
];
export const faqDate = [
  {
    id: 1,
    question: 'چطور رزرو کنم؟',
    answer:
      'پس از مشخص کردن تاریخ ورود و خروج و تعداد نفرات، درخواست رزرو خود را به‌صورت رایگان ثبت کنید تا برای میزبان ارسال ‌شود. میزبان در صورت خالی بودن و مهیا بودن اقامتگاه، رزرو را تایید می‌کند. سپس پیامکی مبنی بر تایید رزرو برای شما ارسال می‌شود و شما حداکثر 30 دقیقه فرصت خواهید داشت تا با پرداخت مبلغ صورتحساب، رزرو را قطعی کرده و سند رزرو حاوی صورتحساب، شماره تماس میزبان، آدرس اقامتگاه و سایر اطلاعات رزرو را دریافت کنید.',
  },
  {
    id: 2,
    question: 'چطور می‌توانم با میزبان تماس بگیرم؟',
    answer:
      'در هنگام ثبت "درخواست رزرو" می‌توانید با استفاده از گزینه "گفتگو با میزبان" سوالات خود را از میزبان اقامتگاه بپرسید. همچنین پس از پرداخت صورتحساب و قطعی شدن رزرو، یک سند رزرو حاوی مشخصات، شماره تماس میزبان و آدرس اقامتگاه برای شما صادر می‌شود و میتوانید با میزبان خود تماس بگیرید.',
  },
  {
    id: 3,
    question: 'با رد یا لغو شدن درخواست رزرو چه می‌شود؟',
    answer:
      'زمانی که میزبان درخواست رزرو شما را رد کند، یک پیامک جهت اطلاع دریافت می‌کنید و می‌توانید برای اقامتگاه دیگری درخواست رزرو ثبت کنید. شما می‌توانید به‌صورت همزمان برای 2 اقامتگاه درخواست رزرو ارسال کنید.',
  },
  {
    id: 4,
    question: 'تایید یا رد درخواست رزرو چقدر طول می‌کشد؟',
    answer:
      'به‌طور میانگین در کمتر از 15 دقیقه به درخواست ها پاسخ داده می‌شود. سابقه زمان پاسخگویی هر میزبان به درخواست های رزرو قبلی با کلیک بر روی تصویر میزبان قابل مشاهده است. حداکثر مهلت پاسخگویی میزبانان به درخواست رزرو در ساعات کاری 30 دقیقه است و در ساعات نیمه شب مهلت پاسخگویی تا صبح روز بعد تمدید می‌گردد. مهلت پاسخگویی به صورت لحظه‌ای در صفحه رزرو قابل مشاهده می‌باشد.',
  },
  {
    id: 5,
    question: 'چه ضمانتی برای تحویل اقامتگاه وجود دارد؟',
    answer:
      'بله، شما می‌توانید «یک مرتبه» درخواست رزرو خود را قبل یا پس از تایید میزبان لغو کنید و درخواست دیگری را ثبت کنید ولی در صورت تکرار لغو رزرو برای بار دوم دیگر قادر به ثبت درخواست نخواهید بود. لذا در ثبت درخواست رزرو دقت لازم را به عمل آورید و با لغو رزرو مکرر موجب بی‌اعتمادی میزبان‌ها نشوید.',
  },
  {
    id: 6,
    question: 'آیا می‌توانم رزرو را قبل یا بعد از تأیید کنسل کنم؟',
    answer:
      'از لحظۀ تأیید درخواست رزرو توسط میزبان که به وسیله پیامک به اطلاع شما خواهد رسید، حداکثر 30 دقیقه فرصت دارید تا با پرداخت صورتحساب، رزرو خود را «قطعی» کنید. پس از پایان این مهلت، رزرو به صورت خودکار لغو شده و در صورت تکرار این امر برای بار دوم دیگر قادر به ثبت درخواست رزرو نخواهید بود. همچنین میزبان این حق را دارد تا پیش از قطعی شدن رزرو، تایید رزرو خود را بردارد که به معنی رد درخواست رزرو از طرف میزبان خواهد بود. در این حالت می‌توانید برای اقامتگاه دیگری درخواست رزرو ثبت کنید.',
  },
  {
    id: 7,
    question: 'اگر پس از تایید رزرو را قطعی نکنم چه می‌شود؟',
    answer:
      'در صورت لغو یک رزرو «پس از قطعی شدن», مقررات لغو رزرو آن اقامتگاه برای محاسبه وجوه پرداختی به میهمان و میزبان ملاک عمل خواهد بود. لذا به «مقررات لغو رزرو» مندرج در سند رزرو توجه کنید.',
  },
  {
    id: 8,
    question: 'جاجیگا به چه معنی ست؟',
    answer:
      'واژه "جاجیگا" در گویش گیلکی، به معنی جا، مکان و محل می‌باشد. همچنین به "جای خواب و استراحت" نیز اطلاق می‌گردد.',
  },
  {
    id: 9,
    question: 'جاجیگا دقیقاً چه خدمتی ارائه می‌دهد؟',
    answer:
      'این کسب و کار بستریست تا میزبانان و صاحبان منازل و اقامتگاه ها بتوانند ملک خود را در محیطی امن و پیشرفته، با صرف حداقل زمان و هزینه برای اجاره روزانه عرضه کنند و از سوی دیگر گردشگران بتوانند اقامتگاهی مطابق با سلیقه و شرایط و بودجه مورد نظر خود را به سهولت در سراسر ایران بیابند و بصورت آنلاین رزرو کنند و سفری بدون دغدغه ی مکان اقامت را در سراسر ایران زیبا تجربه کنند.',
  },
  {
    id: 10,
    question: 'چه مناطقی از کشور تحت پوشش جاجیگا است؟',
    answer:
      'پوشش خدمات جاجیگا به وسعت پهنه جغرافیایی کشور ایران از شهرهای بزرگ تا دورترین روستاها می‌باشد. در حال حاضر بیش از 21000 اقامتگاه در بیش از 250 شهر، روستا و منطقه گردشگری تحت پوشش خدمات جاجیگا قرار گرفته و این روند با سرعتی شتابان در حال افزایش است.',
  },
  {
    id: 11,
    question: 'چه مناطقی از کشور تحت پوشش جاجیگا است؟',
    answer:
      'استارتاپ جاجیگا عضو رسمی پارک علم و فناوری گیلان و دارای گواهی دانش بنیان از معاونت علمی ریاست جمهوری، مجوز گردشگری الکترونیک از وزارت گردشگری، پروانه فعالیت از اتحادیه کشوری کسب و کارهای مجازی و اینماد از وزارت سمت می باشد که تعدادی از آنها در "فوتر" سایت قابل مشاهده است',
  },
  {
    id: 12,
    question: 'هزینه خدمات جاجیگا چقدر است؟',
    answer:
      'تمامی مراحل ایجاد حساب کاربری، جستجو، بررسی، مقایسه و همچنین ثبت و انتشار و معرفی اقامتگاه‌ها در وبسایت بصورت رایگان در اختیار تمامی کاربران می‌باشد. محل درآمد جاجیگا شامل درصدی اندک از هر رزرو "قطعی" است که به عنوان کارمزد از میزبانان دریافت میگردد.',
  },
];
